# 一对单引号或则双引号 表示一行字符串
# 一对三引号 可以表示多行字符串
# 如果希望在引号里面出现引号 可以用()括起来

# 如果字符串中出现个单引号和双引号 那么采用三引号(即：三个单引号),其它且()括起来
# a = 1 # 可以使用str(x)将其它数据类型的数据转化为字符串类型
# str(a)
# print(a)

# 引入一个excel的知识 ctrl + g 定位

# 字符号运算的操作符
# + 对两个字符串进行连接 x + y
# * 对字符串进行复制 例： n * str 或则 str * n （n为正整数）
# in 例 x in s 如果x是s的子串，那么就返回true，否则返回false


# 下面开始介绍一些字符串处理函数

# str = "abd"
# print(len(str)) # 返回字符串长度

# str(x)  # 可以将x转化为字符串 原理：在最左边和最右边加上"
# 对应 eval()函数

# hex(x) oct(x) #  分别将十进制的数x转化为十六进制或则八进制

# unicode 也称为万国码 为每一种语言的每一个字符设置了二进制
# chr(u) #  u为码，返回对应的字符
# ord(x) #  x为字符，返回码



